Revit 2026 API

# ElementGetExternalResourceReferenceExpanded Method

---

Gets the collection of ExternalResourceReference associated with a specified external resource type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ExternalResourceReference> GetExternalResourceReferenceExpanded(
	ExternalResourceType resourceType
)
```
```vb
Public Function GetExternalResourceReferenceExpanded (
	resourceType As ExternalResourceType
) As IList(Of ExternalResourceReference)
```
```cpp
public:
IList<ExternalResourceReference^>^ GetExternalResourceReferenceExpanded(
	ExternalResourceType^ resourceType
)
```
```fsharp
member GetExternalResourceReferenceExpanded :
        resourceType : ExternalResourceType -> IList<ExternalResourceReference>
```

#### Parameters

resourceType ExternalResourceType
     The desired external resource type.

#### Return Value

IListExternalResourceReference The collection of the ExternalResourceReference associated with a specified external resource type.

| Exception | Condition |
| --- | --- |
| ArgumentException | This Element does not use a resource reference for the specified resource type. |
| ArgumentNullException | A non-optional argument was null |

Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReference].

#### Reference

Element Class

Autodesk.Revit.DB Namespace